Tukanos/TukanoBase/artillery-results/shorts_test_CACHE.txt
--------------------------------
Summary report @ 17:22:01(+0000)
--------------------------------

errors.Failed capture or match: ................................................ 1
http.codes.200: ................................................................ 12
http.codes.409: ................................................................ 2
http.downloaded_bytes: ......................................................... 3795
http.request_rate: ............................................................. 11/sec
http.requests: ................................................................. 14
http.response_time:
  min: ......................................................................... 70
  max: ......................................................................... 113
  mean: ........................................................................ 82.1
  median: ...................................................................... 80.6
  p95: ......................................................................... 92.8
  p99: ......................................................................... 92.8
http.response_time.2xx:
  min: ......................................................................... 70
  max: ......................................................................... 92
  mean: ........................................................................ 79.7
  median: ...................................................................... 77.5
  p95: ......................................................................... 89.1
  p99: ......................................................................... 89.1
http.response_time.4xx:
  min: ......................................................................... 81
  max: ......................................................................... 113
  mean: ........................................................................ 97
  median: ...................................................................... 80.6
  p95: ......................................................................... 80.6
  p99: ......................................................................... 80.6
http.responses: ................................................................ 14
plugins.metrics-by-endpoint./tukano-1/rest/shorts/SergioDuarte/shorts?hasCac...  1
plugins.metrics-by-endpoint./tukano-1/rest/shorts/SergioDuarte?pwd=easypass&...  1
plugins.metrics-by-endpoint./tukano-1/rest/shorts/kGallagher/shorts?hasCache...  1
plugins.metrics-by-endpoint./tukano-1/rest/shorts/kGallagher?pwd=easypass&ha...  2
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ s1id }}?hasCache={{ has...  3
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ s2id }}?hasCache={{ has...  4
plugins.metrics-by-endpoint./tukano-1/rest/users/?hasCache={{ hasCache }}.co...  2
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/SergioDuarte/shorts?hasCache={{ hasCache }}:
  min: ......................................................................... 70
  max: ......................................................................... 70
  mean: ........................................................................ 70
  median: ...................................................................... 70.1
  p95: ......................................................................... 70.1
  p99: ......................................................................... 70.1
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/SergioDuarte?pwd=easypass&hasCache={{ hasCache }}:
  min: ......................................................................... 89
  max: ......................................................................... 89
  mean: ........................................................................ 89
  median: ...................................................................... 89.1
  p95: ......................................................................... 89.1
  p99: ......................................................................... 89.1
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/kGallagher/shorts?hasCache={{ hasCache }}:
  min: ......................................................................... 81
  max: ......................................................................... 81
  mean: ........................................................................ 81
  median: ...................................................................... 80.6
  p95: ......................................................................... 80.6
  p99: ......................................................................... 80.6
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/kGallagher?pwd=easypass&hasCache={{ hasCache }}:
  min: ......................................................................... 78
  max: ......................................................................... 80
  mean: ........................................................................ 79
  median: ...................................................................... 77.5
  p95: ......................................................................... 77.5
  p99: ......................................................................... 77.5
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/{{ s1id }}?hasCache={{ hasCache }}:
  min: ......................................................................... 75
  max: ......................................................................... 80
  mean: ........................................................................ 77
  median: ...................................................................... 76
  p95: ......................................................................... 76
  p99: ......................................................................... 76
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/{{ s2id }}?hasCache={{ hasCache }}:
  min: ......................................................................... 70
  max: ......................................................................... 92
  mean: ........................................................................ 81.8
  median: ...................................................................... 77.5
  p95: ......................................................................... 87.4
  p99: ......................................................................... 87.4
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/?hasCache={{ hasCache }}:
  min: ......................................................................... 81
  max: ......................................................................... 113
  mean: ........................................................................ 97
  median: ...................................................................... 80.6
  p95: ......................................................................... 80.6
  p99: ......................................................................... 80.6
vusers.created: ................................................................ 1
vusers.created_by_name.TukanoShorts: ........................................... 1
vusers.failed: ................................................................. 1