Tukanos/TukanoBase/artillery-results/shorts_test_NO_CACHE.txt
--------------------------------
Summary report @ 17:53:46(+0000)
--------------------------------

errors.Failed capture or match: ................................................ 1
http.codes.200: ................................................................ 14
http.downloaded_bytes: ......................................................... 3395
http.request_rate: ............................................................. 11/sec
http.requests: ................................................................. 14
http.response_time:
  min: ......................................................................... 66
  max: ......................................................................... 105
  mean: ........................................................................ 82
  median: ...................................................................... 77.5
  p95: ......................................................................... 96.6
  p99: ......................................................................... 96.6
http.response_time.2xx:
  min: ......................................................................... 66
  max: ......................................................................... 105
  mean: ........................................................................ 82
  median: ...................................................................... 77.5
  p95: ......................................................................... 96.6
  p99: ......................................................................... 96.6
http.responses: ................................................................ 14
plugins.metrics-by-endpoint./tukano-1/rest/shorts/SergioDuarte/shorts?hasCac...  1
plugins.metrics-by-endpoint./tukano-1/rest/shorts/SergioDuarte?pwd=easypass&...  1
plugins.metrics-by-endpoint./tukano-1/rest/shorts/kGallagher/shorts?hasCache...  1
plugins.metrics-by-endpoint./tukano-1/rest/shorts/kGallagher?pwd=easypass&ha...  2
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ s1id }}?hasCache={{ has...  3
plugins.metrics-by-endpoint./tukano-1/rest/shorts/{{ s2id }}?hasCache={{ has...  4
plugins.metrics-by-endpoint./tukano-1/rest/users/?hasCache={{ hasCache }}.co...  2
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/SergioDuarte/shorts?hasCache={{ hasCache }}:
  min: ......................................................................... 75
  max: ......................................................................... 75
  mean: ........................................................................ 75
  median: ...................................................................... 74.4
  p95: ......................................................................... 74.4
  p99: ......................................................................... 74.4
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/SergioDuarte?pwd=easypass&hasCache={{ hasCache }}:
  min: ......................................................................... 73
  max: ......................................................................... 73
  mean: ........................................................................ 73
  median: ...................................................................... 73
  p95: ......................................................................... 73
  p99: ......................................................................... 73
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/kGallagher/shorts?hasCache={{ hasCache }}:
  min: ......................................................................... 74
  max: ......................................................................... 74
  mean: ........................................................................ 74
  median: ...................................................................... 74.4
  p95: ......................................................................... 74.4
  p99: ......................................................................... 74.4
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/kGallagher?pwd=easypass&hasCache={{ hasCache }}:
  min: ......................................................................... 66
  max: ......................................................................... 82
  mean: ........................................................................ 74
  median: ...................................................................... 66
  p95: ......................................................................... 66
  p99: ......................................................................... 66
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/{{ s1id }}?hasCache={{ hasCache }}:
  min: ......................................................................... 74
  max: ......................................................................... 94
  mean: ........................................................................ 81.7
  median: ...................................................................... 77.5
  p95: ......................................................................... 77.5
  p99: ......................................................................... 77.5
plugins.metrics-by-endpoint.response_time./tukano-1/rest/shorts/{{ s2id }}?hasCache={{ hasCache }}:
  min: ......................................................................... 73
  max: ......................................................................... 96
  mean: ........................................................................ 86.3
  median: ...................................................................... 80.6
  p95: ......................................................................... 96.6
  p99: ......................................................................... 96.6
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/?hasCache={{ hasCache }}:
  min: ......................................................................... 83
  max: ......................................................................... 105
  mean: ........................................................................ 94
  median: ...................................................................... 82.3
  p95: ......................................................................... 82.3
  p99: ......................................................................... 82.3
vusers.created: ................................................................ 1
vusers.created_by_name.TukanoShorts: ........................................... 1
vusers.failed: ................................................................. 1